import NotAPage from "@/data/components/NotAPage"

type txt = string[][]

export namespace defText {
  export const all: txt = [
    [
      "當大家還在爭論最好用的程式語言的時候",
      "我想過C 我想過C# 我甚至想過JAVA 還有TS",
      "結果現在最好用的語言是Markdown.....抽象",
    ],
    [
      "我曾經一度想過我要客制化這個Monaco編輯器",
      "一開始的想法是 額 我直接套個色彩圖層 然後用混合模式把顔色强加在上面",
      "效果是有了 但其實不太好 所以後來就 想要搞個主題出來",
      "但......做主題最重要的就是 我需要有選字 這樣我才能知道我能改什麽",
      "然而 不知道是他的`.d.ts`沒寫好還是怎樣 他就是沒選字",
      "搞到我一度很崩潰 就 我完全不知道要怎麽辦",
      "那後來 是有過 額 我把我現有的VSCode主題轉成Monaco編輯器的主題",
      "但 也失敗了 原因是 轉換工具過舊 讀不懂新的標準",
      "所以 最終 我放棄了 索性不搞了",
      "也就有了這個用著原生主題的編輯器",
    ],
    [
      "其實這個編輯器他也不完全是 你裝下來之後你能夠直接離綫使用的",
      "就....我後來才知道他預設讀庫是直接去cdn伺服器讀的 不是讀你下載下來的東西",
      "所以 在我自己的作品集裏面 我又特別指定讀取的路徑",
      "不然每次開編輯器 等他loading要等半天 我真的一度以爲我做錯了什麽 甚至以爲他不相容于其他作業系統",
    ],
  ]

  export const kilo: txt = [
    [
      "其實這個KILO特調版不止改過元件 甚至改過寫法",
      "在原版 欸 我們要換行 要先空兩格才可以換行",
      "但是我特調的版本不需要 換 就是直接換",
      "所以 因爲這件事情 這一組隨機文字 會檢查目前的模式",
      "如果是我特調的 那就什麽都不做",
      "如果是原版的 那就把換行轉成空兩格換行",
    ],
    [
      "其實我的自定元件啊 額就是",
      "# 我們常看到的標題",
      "## 副標題 啊 之類的",
      "在2022年的KILO-LOG 就有了",
      "然後是自從接觸了Next 瞭解了Markdown之後 我才把這東西發揚光大的",
      "只是我現階段還是覺得 這東西 還是不太適合正式寫文章用",
      "帥歸帥 但感覺還是.....有點抽象 啊 這很難講啦"
    ],
  ]

  export const nor: txt = [
    [
      "一直以來 Markdown 一直有個 讓我很痛苦的東西 就是換行",
      "就 我知道 這東西是有特殊目的的 但就是 我還是覺得空兩格換行真的有點陰間",
      "不過最後我還是妥協了啦 反正 也.....不是一件壞事 最多就是 自己做個轉換器 不然就.....改一下自己的習慣嘛",
      "現在的文字編輯器也很好用了",
    ],
  ]
}

export default function () {
  return <NotAPage
    info={[
      "這個是TCFTI的色卡",
      "你可以在這裏直接調用TCFTI的色卡 還挺好"
    ]}
  />
}