import NotAPage from "@/data/components/NotAPage"

interface Color {
  id: string
  name?: string
  colors: string[]
}

export const TCFTI_List: Color[] = [
  {
    id: "104172324",
    name:"經典配色",
    colors: [
      "#feeab5",
      "#fed89f",
      "#e7b580",
      "#b29873",
      "#876040",
      "#beccb2",
      "#747766",
      "#435b5d",
      "#2f3439",
      "#413e45",
      "#171e24",
      "#292e34",
      "#1c2125",
      "#1f2734",
      "#13171a",
      "#0b0f13"
    ]
  },
  {
    id: "92142600",
    name:"帶點科技感的淺藍色",
    colors: [
      "#c5caca",
      "#a7bbb7",
      "#3c444a",
      "#535761",
      "#3b3a46",
      "#494c5c",
      "#1c2024",
      "#252b37",
      "#d8f5fb",
      "#b1e4ed",
      "#3de0fb",
      "#627e93",
      "#5e80ab",
      "#197886"
    ]
  },
  {
    id: "87377769",
    name:"深海裏微微的青綠色（？",
    colors: [
      "#72ada2",
      "#00ffb4",
      "#36ffde",
      "#51d0bb",
      "#5ac3a4",
      "#3fa494",
      "#26655a",
      "#0c5b54",
      "#12676c",
      "#1e333a",
      "#0e3345",
      "#072130",
      "#17252d",
      "#030d13",
      "#05161f",
      "#030d13"
    ]
  },
  {
    id: "109556597",
    name:"你住在樹裏面的木頭色",
    colors: [
      "#F2ECC1",
      "#C2B390",
      "#B6A469",
      "#978255",
      "#CAB670",
      "#BDA15F",
      "#C98437",
      "#AB6926",
      "#865C37",
      "#93722B",
      "#AA7E4D",
      "#685738",
      "#694F2E",
      "#514627",
      "#3E331F",
      "#46503D",
      "#3B4633",
      "#2C3729",
      "#191D1A",
      "#2D160F",
      "#1D150E"
    ]
  },
  /* Wait For Do */
  {
    id: "100581107",
    colors: [
      "#FFFAE7",
      "#DFD8BE",
      "#BDB898",
      "#AEAA88",
      "#706140",
      "#53462C",
      "#B19244",
      "#C3AF60",
      "#B69C25",
      "#7E630C",
      "#706D5C",
      "#4E4C3F",
      "#5F6854",
      "#31372C",
      "#313126",
      "#BBBAA7",
      "#9F9075",
      "#8F7264",
      "#735547",
      "#A25835",
      "#883D20",
      "#82878D",
      "#565B61",
      "#2C3745",
      "#2A3133",
      "#151616",
      "#181818",
      "#1C1A15"
    ]
  },
  {
    id: "94645255 [05]",
    colors: [
      "#ADB1CC",
      "#6D6E8A",
      "#60617D",
      "#4E5679",
      "#526495",
      "#41487E",
      "#212759",
      "#121540",
      "#1C1B29",
      "#0F0E16"
    ]
  },
  {
    id: "55472736",
    colors: [
      "#DFDFDF",
      "#BDBDBD",
      "#BCBCBC",
      "#A2A1A1",
      "#808080",
      "#CFC3C3",
      "#A0898A",
      "#795B5B",
      "#4D2726",
      "#270000"
    ]
  },
  {
    id: "54150558",
    colors: [
      "#FEFBAC",
      "#FFE6A6",
      "#FFEB80",
      "#FFD67C",
      "#FFB963",
      "#F4A057",
      "#FEA154",
      "#E08149",
      "#6F3F31",
      "#170B0B"
    ]
  }
]

export default function () {
  return <NotAPage
    info={[
      "這個是TCFTI的色卡",
      "你可以在這裏直接調用TCFTI的色卡 還挺好"
    ]}
  />
}